app/views/candidates/index.html.erb

SELECT COUNT(*) FROM "vote_logs" WHERE "vote_logs"."candidate_id" = $1  [["candidate_id", 1]]
---
      <td><%= candidate.politics %></td>
      <td><%= candidate.vote_logs.size %></td>