app/controllers/candidates_controller.rb

INSERT INTO "candidates" ("name", "age", "party", "politics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "孫悟空"], ["age", 18], ["party", ""], ["politics", ""], ["created_at", "2024-03-10 08:59:31.763129"], ["updated_at", "2024-03-10 08:59:31.763129"]]
---
    def create
        @candidate = Candidate.new(candidate_params)

        if @candidate.save

INSERT INTO "vote_logs" ("ip_address", "candidate_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["ip_address", "::1"], ["candidate_id", 1], ["created_at", "2024-03-10 10:01:10.548527"], ["updated_at", "2024-03-10 10:01:10.548527"]]
---
    def vote
        # @candidate.increment(:votes)
        # @candidate.save
        @candidate.vote_logs.create(ip_address: request.remote_ip) if @candidate

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = $1 LIMIT 1  [["id", 1]]
---
    def find_candidate
        @candidate = Candidate.find_by(id: params[:id])