app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "tel", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Kai"], ["email", "demo.kai23444@gmail.com"], ["tel", "1111"], ["created_at", "2024-03-17 14:51:43.557785"], ["updated_at", "2024-03-17 14:51:43.557785"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save